rails/app/controllers/home_controller.rb

  def index
    @hotels = Hotel.all
---
SELECT "hotels".* FROM "hotels"