rails/app/controllers/hotels_controller.rb

  def index
    @hotels = Hotel.all
---
SELECT "hotels".* FROM "hotels"

  def show
    @hotel = Hotel.find(params[:id])
---
SELECT "hotels".* FROM "hotels" WHERE "hotels"."id" = 2 LIMIT 1