rails/app/controllers/orders_controller.rb

SELECT "orders".* FROM "orders" WHERE "orders"."user_id" = 2 ORDER BY "orders"."created_at" DESC
---
  def index
    @orders = current_user.orders.includes(food: :hotel).order(created_at: :desc)

SELECT "foods".* FROM "foods" WHERE "foods"."id" = 1 LIMIT 1
---
  def new
    @food = Food.find(params[:food_id])

SELECT "foods".* FROM "foods" WHERE "foods"."id" = 1 LIMIT 1
INSERT INTO "orders" ("user_id", "food_id", "quantity", "total_price", "created_at", "updated_at") VALUES (2, 1, 1, 15.99, '2025-06-07 16:38:56.280770', '2025-06-07 16:38:56.280770') RETURNING "id"
---
  def create
    @food = Food.find(params[:food_id])
    @order = current_user.orders.build(order_params)
    @order.food = @food

    if @order.save